In [1]:

import pandas as pd

In [2]:
data= pd.DataFrame  ( {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 
  'Age': [25, 30, 35, 40, 45], 
  'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Operations']
}  )
data

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

In [3]:
data[data['Name']=='Charlie']

      Name  Age Department
2  Charlie   35    Finance

In [4]:
 result=data.loc[data['Age']>30]
 result

      Name  Age  Department
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

In [5]:
data.iloc[[2]]

      Name  Age Department
2  Charlie   35    Finance

In [6]:
data.iloc[:3,:2]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [7]:
data.loc[3,'Age']=42
data

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations

In [8]:
data

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations

In [9]:
data.loc[data['Department']=='IT', 'Department']='Tech Support '

In [10]:
data

      Name  Age     Department
0    Alice   25             HR
1      Bob   30  Tech Support
2  Charlie   35        Finance
3    David   42      Marketing
4      Eve   45     Operations